particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    // Enter critical section
    os_thread_scheduling(false, nullptr);

    // Run QSPI TASK_ACTIVATE task as a workaround for the anomaly 215
    exflash_qspi_activate();
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

    // This may block for up to 1ms (QSPI_DEF_WAIT_TIME_US * QSPI_DEF_WAIT_ATTEMPTS)
    nrfx_err_t err = nrfx_qspi_cinstr_xfer(p_config, p_tx_buffer, p_rx_buffer);

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    // Exit critical section
    os_thread_scheduling(true, nullptr);
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    return nrf_system_error(err);
}

int exflash_qspi_cinstr_quick_send(uint8_t opcode, nrf_qspi_cinstr_len_t length, void const* p_tx_buffer) {
    nrf_qspi_cinstr_conf_t config = NRFX_QSPI_DEFAULT_CINSTR(opcode, length);
    return exflash_qspi_cinstr_xfer(&config, p_tx_buffer, nullptr);
}

int perform_write(uintptr_t addr, const uint8_t* data, size_t size) {
    return nrf_system_error(nrfx_qspi_write(data, size, addr));
}

nrf_qspi_cinstr_len_t get_nrf_cinstr_length(size_t length) {
    nrf_qspi_cinstr_len_t cinstrLen = NRF_QSPI_CINSTR_LEN_1B;
    switch (length) {
        case 1: cinstrLen = NRF_QSPI_CINSTR_LEN_1B; break;
        case 2: cinstrLen = NRF_QSPI_CINSTR_LEN_2B; break;
        case 3: cinstrLen = NRF_QSPI_CINSTR_LEN_3B; break;
        case 4: cinstrLen = NRF_QSPI_CINSTR_LEN_4B; break;
        case 5: cinstrLen = NRF_QSPI_CINSTR_LEN_5B; break;
        case 6: cinstrLen = NRF_QSPI_CINSTR_LEN_6B; break;
        case 7: cinstrLen = NRF_QSPI_CINSTR_LEN_7B; break;
        case 8: cinstrLen = NRF_QSPI_CINSTR_LEN_8B; break;
        case 9: cinstrLen = NRF_QSPI_CINSTR_LEN_9B; break;
        default: break;
    }
    return cinstrLen;
}

int mx25_enter_secure_otp() {
    return exflash_qspi_cinstr_quick_send(HAL_QSPI_CMD_MX25_ENSO, get_nrf_cinstr_length(1), nullptr);
}

int mx25_exit_secure_otp() {
    return exflash_qspi_cinstr_quick_send(HAL_QSPI_CMD_MX25_EXSO, get_nrf_cinstr_length(1), nullptr);
}

int mx25r64_switch_to_qspi() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = PRTCL_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_STD_WRSR, NRF_QSPI_CINSTR_LEN_4B);
    // Status register, configuration register 1, configuration register 2 values
    uint8_t config_values[3] = { 0x40, 0x00, 0x02 };
    return exflash_qspi_cinstr_xfer(&cinstr_cfg, config_values, nullptr);
}

int mx25l32_switch_to_qspi() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = PRTCL_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_STD_WRSR, NRF_QSPI_CINSTR_LEN_2B);
    uint8_t status_register[1] = { 0x40 };
    return exflash_qspi_cinstr_xfer(&cinstr_cfg, status_register, nullptr);
}

int gd25_switch_to_qspi() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = PRTCL_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_STD_WRSR, NRF_QSPI_CINSTR_LEN_2B);
    uint8_t status_registers[3] = {0x00, 0x02, 0x00};

    CHECK_FALSE(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[0], nullptr), SYSTEM_ERROR_FLASH_IO);
    
    cinstr_cfg.opcode = HAL_QSPI_CMD_GD25_WRSR2;
    CHECK_FALSE(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[1], nullptr), SYSTEM_ERROR_FLASH_IO);

    cinstr_cfg.opcode = HAL_QSPI_CMD_GD25_WRSR3;
    CHECK_FALSE(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[2], nullptr), SYSTEM_ERROR_FLASH_IO);

    return 0;
}

int gd25_secure_register_read(uint8_t security_registers_index, uint32_t security_registers_addr, void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < GD25_SECURITY_REGISTER_COUNT, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= GD25_OTP_SECTOR_SIZE, SYSTEM_ERROR_INVALID_ARGUMENT);

    nrf_qspi_cinstr_conf_t readSecurityRegister = PRTCL_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_GD25_SEC_READ, NRF_QSPI_CINSTR_LEN_1B);

    // 3 bytes of address data + 1 byte of dummy data
    uint8_t addrBuf[4] = {}; 
    uint32_t address = ((security_registers_index + 1) << 12) + security_registers_addr;
    addrBuf[0] = (uint8_t)((address>>16) & 0xFF);
    addrBuf[1] = (uint8_t)((address>>8) & 0xFF);
    addrBuf[2] = (uint8_t)((address>>0) & 0xFF);
    addrBuf[3] = 0x00;

    // start long frame transfer with "Read Security Register" opcode
    nrfx_err_t ret = nrfx_qspi_lfm_start(&readSecurityRegister);
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));
    nrf_delay_us(10); // need a bit delay to switch between normal flash and security register
    // Send address + dummy bytes, do not finalize long frame transfer
    ret = nrfx_qspi_lfm_xfer(addrBuf, nullptr, sizeof(addrBuf), false);
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));
    // Read security register data, finalize long frame transfer
    ret = nrfx_qspi_lfm_xfer(nullptr, buf, size, true);
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));

    return 0;
}

int gd25_secure_register_write(uint8_t security_registers_index, uint32_t security_registers_addr, const void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < GD25_SECURITY_REGISTER_COUNT, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= GD25_OTP_SECTOR_SIZE, SYSTEM_ERROR_INVALID_ARGUMENT);

    nrf_qspi_cinstr_conf_t writeSecurityRegister = PRTCL_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_GD25_SEC_PROGRAM, NRF_QSPI_CINSTR_LEN_1B);

    uint32_t address = 0;
    uint8_t addrBuf[3] = {};
    address = ((security_registers_index + 1) << 12) + security_registers_addr;
    addrBuf[0] = (uint8_t)((address>>16) & 0xFF);
    addrBuf[1] = (uint8_t)((address>>8) & 0xFF);
    addrBuf[2] = (uint8_t)((address>>0) & 0xFF);

    nrfx_err_t ret = nrfx_qspi_lfm_start(&writeSecurityRegister);
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));
    nrf_delay_us(10); // need a bit delay to switch between normal flash and security register
    ret = nrfx_qspi_lfm_xfer(addrBuf, nullptr, sizeof(addrBuf), false); // Send address bytes, do not finalize long frame transfer
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));
    ret = nrfx_qspi_lfm_xfer(buf, nullptr, size, true); // Send data to write, finalize long frame transfer
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));

