particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
        // Execute the command.
        CHECK(exflash_qspi_cinstr_xfer(&cinstr_cfg, nullptr, result));

        // For the reset procedure, we need to execute the reset command going forward.
        if (cmd == HAL_EXFLASH_COMMAND_RESET) {
            cinstr_cfg.opcode = HAL_QSPI_CMD_STD_RST;
            CHECK(exflash_qspi_cinstr_xfer(&cinstr_cfg, nullptr, nullptr));
            switch (flash_type) {
                case HAL_QSPI_FLASH_TYPE_MX25L3233F: {
                    CHECK(mx25l32_switch_to_qspi());
                    break;
                };
                case HAL_QSPI_FLASH_TYPE_MX25R6435F: {
                    CHECK(mx25r64_switch_to_qspi());
                    break;
                };
                case HAL_QSPI_FLASH_TYPE_GD25WQ64E: {
                    CHECK(gd25_switch_to_qspi());
                    break;
                };
                default:
                    break;
            }
        }
    } else if (sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP) {
        /* OTP-specific commands */
        if (cmd == HAL_EXFLASH_COMMAND_LOCK_ENTIRE_OTP) {
            /* Secured OTP Indicator bit (4K-bit Secured OTP)
             * 1 = factory lock
             * This will block the whole OTP region.
             */
            uint8_t v = 0x01;
            if (flash_type == HAL_QSPI_FLASH_TYPE_MX25L3233F || flash_type == HAL_QSPI_FLASH_TYPE_MX25R6435F) {
                CHECK(exflash_qspi_cinstr_quick_send(HAL_QSPI_CMD_MX25_WRSCUR, get_nrf_cinstr_length(2), &v));
            }
        }
    }

    return SYSTEM_ERROR_NONE;
}

int hal_exflash_sleep(bool sleep, void* reserved) {
    FlashLock lk;

    if (sleep) {
        // Suspend external flash
        if (qspi_state != HAL_EXFLASH_STATE_ENABLED) {
            return SYSTEM_ERROR_INVALID_STATE;
        }
        // Put external flash into Deep Power-down mode
        if (hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SLEEP, nullptr, nullptr, 0)) {
            // It may fail as the flash chip might be in an ongoing program/erase operation. Suspend it.
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SUSPEND_PGMERS, nullptr, nullptr, 0);
            // Abort the suspended write/erase operation.
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, nullptr, nullptr, 0);
            // Try enter Deep Power-down mode again
            int ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SLEEP, nullptr, nullptr, 0);
            if (ret) {
                // Give up entering Deep Power-down mode.
                return ret;
            }
        }
        // Disable QSPI peripheral
        hal_exflash_uninit();
        qspi_state = HAL_EXFLASH_STATE_SUSPENDED;
    } else {
        // Restore external flash
        if (qspi_state != HAL_EXFLASH_STATE_SUSPENDED) {
            return SYSTEM_ERROR_INVALID_STATE;
        }
        int ret = hal_exflash_init();
        if (ret != SYSTEM_ERROR_NONE) {
            return ret;
        }
    }
    return SYSTEM_ERROR_NONE;
}

int hal_exflash_otp_size(void) {
    const hal_exflash_params_t* flash_params = hal_exflash_get_params(flash_type);
    CHECK_TRUE(flash_params, SYSTEM_ERROR_NOT_FOUND);
    return (int)flash_params->otp_size;
}
